from nltk.tokenize import sent_tokenize, word_tokenize
from tkinter import filedialog

from tkinter import filedialog

filename = filedialog.askopenfile()
fileReadyToRead = open(filename.name, 'r')
file_contents = fileReadyToRead.read()

data = file_contents
pinakas=(word_tokenize(data))

stopwords = [ 'ΑΛΛΟΣ','άλλος','εγώ','ΕΓΩ','ΕΜΕΝΑ','ΕΜΕΙΣ','ΕΜΑΣ','ΜΟΥ' ,'ΜΕ' ,'ΜΑΣ' ,'ΕΣΥ'
,'ΕΣΕΝΑ','ΕΣΑΣ' ,'ΣΟΥ' ,'ΣΕ' ,'ΣΑΣ','ΑΥΤΟΣ','ΑΥΤΟΥ','ΑΥΤΟΙ','ΑΥΤΩΝ','ΑΥΤΟΥΣ',
 'ΤΟΣ' ,'ΤΟΥ' ,'ΤΟΝ' ,'ΤΟΙ' ,'ΤΟΥΣ' ,'ΑΥΤΗ','ΑΥΤΗΣ','ΑΥΤΗΝ','ΑΥΤΕΣ' , 'ΤΗ' ,'ΤΗΣ' ,'ΤΗΝ' ,'ΤΕΣ'
,'ΤΟΥΣ' ,'ΤΙΣ' ,'ΑΥΤΟ','ΑΥΤΟΥ','ΑΥΤΑ' , 'ΤΟ' ,'ΤΟΥ' ,'ΤΑ' ,'ΤΟΥΣ','ΕΣΕΙΣ','ΑΥΤΑ' ,'ΣΤΗΝ' ,'ΣΤΗ','ΣΤΑ' ,
 'ΣΤΟ' ,'ΣΤΟΝ' ,'ΣΤΟΥΣ','ΣΤΩΝ','ΣΤΙΣ','Ο' ,'Η' ,'ΤΟ' , 'ΟΙ' ,'ΤΩΝ','ΤΟΥΣ',
 'Η' ,'ΤΗΣ','ΤΗ' , 'ΤΙΣ','ΤΟΥ','ΤΑ', 'ΤΟΝ','ΤΗΝ', 'ΑΝΑ' , 'ΠΑΡΑ' , 'ΚΑΤΑ' , 'ΔΙΑ' , 'ΜΕΤΑ' , 'ΑΝΤΙ' ,
'ΑΜΦΙ', 'ΠΕΡΙ', 'ΕΠΙ', 'ΑΠΟ', 'ΥΠΟ' , 'ΥΠΕΡ' , 'ΕΙΣ' , 'ΕΝ' , 'ΕΚ' , 'ΕΞ' ,
'ΠΡΟ' , 'ΠΡΟΣ', 'ΣΥΝ', 'ΑΧΡΙ', 'ΜΕΧΡΙ' , 'ΑΝΕΥ' , 'ΧΩΡΙΣ' , 'ΠΛΗΝ', 'ΕΝΕΚΑ', 'ΕΝΕΚΕΝ', 'ΜΑ', 'ΝΗ',
'ΕΝΑΝΤΙΟΝ', 'ΕΝΑΝΤΙ', 'ΕΝΑΝΤΙΑ', 'ΩΣ', 'ΣΑΝ', 'ΓΙΑ', 'ΕΩΣ', 'ΠΡΟΤΟΥ', 'ΝΑ', 'ΑΝ', 'ΘΑ', 'ΕΙΝΑΙ',

'άλλος','εγώ','εμένα','εμείς','εμάς','μου','με','μας','εσύ',
'εσένα','εσάς','σου','σε','σας','αυτός','αυτού','αυτοί','αυτών','αυτούς',
'τος','του','τον','τοι','τους','αυτή','αυτής','αυτήν','αυτές','τη','της','την','τες'
,'τους','τις','αυτό','αυτά','το','του','τα','τους','εσείς','στην','στη','στα',
'στο','στον','στους','στων','στις','ο','η','το','οι','των','τους',
'ή','της','τις','τα','ανα','ανά','παρά','κατά','διά','μετά','αντί',
'αμφί','περί','επί','επι','απο','υπο','υπέρ','εις','εν','εκ','εξ'
,'προ','προς','συν','αρχι','μέχρι','άνευ','χωρίς','πλην','ένεκα','μα','νη',
'εναντίον','έναντι','ενάντια','ως','σαν','για','έως','προτού','να','αν','θα','είναι']


for word in list(pinakas):  # iterating on a copy since removing will mess things up
    if word in stopwords:
        pinakas.remove(word)
print("")
print("Αυτό είναι το κείμενο μετα την διαγραφή των άχρηστων λέξεων :")
print("")
print(pinakas)

